app/Http/Controllers/Front/TemplateController.php

    public function index($name, $id){
        $filt=BdtdcCompany::find($id);

        if($filt == null){
            return '<div style="margin:0 auto;width:40%;margin-top:10%;border:1px double rebeccapurple;"><h1 style="text-align:center;color:forestgreen;">Company profile not available!!!</h1><p style="text-align:center;"><a style="text-decoration:none;" href="/">Go to home page</a></p></div>';
        }
        $profile_owner_id = $filt->user_id;

        $company_info = BdtdcCompany::with(['company_description','customers','customers.suppliers','location_of_reg_string','customers.suppliers.business_types','tradeinfo','tradeinfo.BdtdcFormValue'])->find($id);

        $company_images=BdtdcCompanyImage::where('company_id',$id)->first();
        $data['main_products'] = BdtdcSupplierMainProduct::where('supplier_id',$profile_owner_id)->get();
        $data['product_groups']=BdtdcSupplierProductGroups::where('company_id',$id)->get();

        $products_list = BdtdcProductToCategory::with(['bdtdcProduct','bdtdcCategory','pro_images','pro_to_cat_name','pro_images_new','pro_parent_cat','bdtdc_suppliers', 'supp_company'])
                                            ->where('company_id',$id)
                                            ->take(30)
                                            ->get();
        $products_lists = BdtdcProductToCategory::with(['bdtdcProduct','bdtdcCategory','pro_images','pro_to_cat_name','pro_images_new','pro_parent_cat','bdtdc_suppliers'])
                                            ->where('company_id',$id)
                                            ->take(6)
                                            ->get();

        $supplier_product_group_ar = BdtdcSupplierProductGroups::with(['BdtdcSupplierProductGroupsProducts', 'BdtdcSupplierProductGroupsProducts.product_name', 'BdtdcSupplierProductGroupsProducts.product_image_new'])
                                    ->where('company_id',$id)->get();
        $company_images=BdtdcCompanyImage::where('company_id',$id)->first();

        $template_setting_data = BdtdcTemplateSetting::with(['template_section'])
                ->where('company_id',$id)
                ->get();
---
select * from `bdtdc_companies` where `bdtdc_companies`.`id` = '851' limit 1
select * from `bdtdc_company_descriptions` where `bdtdc_company_descriptions`.`company_id` in (851)
select * from `bdtdc_form_values` where `bdtdc_form_values`.`id` in (103)
select * from `bdtdc_company_images` where `company_id` = '851' limit 1
select * from `bdtdc_supplier_main_products` where `supplier_id` = 931
select * from `bdtdc_supplier_product_groups` where `company_id` = '851'
select * from `bdtdc_category` where `bdtdc_category`.`id` in (44, 47, 50, 193)
select * from `bdtdc_product_to_category` where `company_id` = '851' limit 30
select * from `bdtdc_product` where `bdtdc_product`.`id` in (1283, 1286, 1289, 1293, 1297, 1301, 1303, 1306, 1315, 1318, 1321, 1324, 1328, 1331, 1333, 1336, 1352, 1356, 1362, 1365, 1369, 1370, 1373, 1377, 1379, 1381, 1383, 1387, 1388)
select * from `bdtdc_suppliers` where `bdtdc_suppliers`.`company_id` in (851)
select * from `bdtdc_category` where `bdtdc_category`.`id` in (44)
select * from `bdtdc_product_to_category` where `company_id` = '851' limit 6
select * from `bdtdc_product` where `bdtdc_product`.`id` in (1283, 1286, 1289, 1293, 1297, 1301)
select * from `bdtdc_product_images` where `bdtdc_product_images`.`product_id` in (1283, 1286, 1289, 1293, 1297, 1301, 1303, 1306, 1315, 1318, 1321, 1324, 1328, 1331, 1333, 1336, 1352, 1356, 1362, 1365, 1369, 1370, 1373, 1377, 1379, 1381, 1383, 1387, 1388)
select * from `bdtdc_template_sections` where `bdtdc_template_sections`.`id` in (1, 2, 3)
select * from `bdtdc_template_settings` where `company_id` = '851'

        }
        $data['inactive_product_list'] = $inactive_product_list;

        $data['user_active_data'] = User::where('id',$profile_owner_id)->first();

        $event_visit =BdtdcCompany::where('id',$id)->first();
---
select * from `users` where `id` = 931 limit 1
select * from `bdtdc_companies` where `id` = '851' limit 1

    public function show_company($name=false, $id=false){
        $event_visit =BdtdcCompany::find($id);

        $event_visit->visits = $event_visit->visits + 1;
        $event_visit->save();
        $id = Route::current()->parameters()['profile_id'];
        if ($event_visit == null) {
            return '<div style="margin:0 auto;width:40%;margin-top:10%;border:1px double rebeccapurple;"><h1 style="text-align:center;color:forestgreen;">Company profile not available!!!</h1><p style="text-align:center;"><a style="text-decoration:none;" href="../template_/'.$id.'">Back</a> | <a style="text-decoration:none;" href="/">Go to home page</a> | <a style="text-decoration:none;" onclick="javascript:window.history.back();">Back</a></p></div>';
        }
        $profile_owner_id = $event_visit->user_id;

        $company = BdtdcCompany::with(['company_description','customers','customers.suppliers','location_of_reg_string','customers.suppliers.business_types','tradeinfo','tradeinfo.BdtdcFormValue','tradeinfo.form_export_percentage'])->find($id);

        $data['product_groups'] = BdtdcSupplierProductGroups::where('company_id',$id)->get();

        $main_products = BdtdcCompany::with('main_products')->where('id',$id)->first();

        $company_images=BdtdcCompanyImage::where('company_id',$id)->first();
---
update `bdtdc_companies` set `updated_at` = '2020-12-13 00:46:06', `visits` = 52 where `id` = 2168
select * from `bdtdc_companies` where `bdtdc_companies`.`id` = '2168' limit 1
select * from `bdtdc_company_descriptions` where `bdtdc_company_descriptions`.`company_id` in (2168)
select * from `bdtdc_form_values` where `bdtdc_form_values`.`id` in (101)
select * from `bdtdc_supplier_product_groups` where `company_id` = '2168'
select * from `bdtdc_companies` where `id` = '2168' limit 1
select * from `bdtdc_company_images` where `company_id` = '2168' limit 1

    public function get_contact($name=false, $profile_id=false){
        $event_visit =BdtdcCompany::find($profile_id);

        $event_visit->visits = $event_visit->visits + 1;
        $event_visit->save();

        $contact_data = BdtdcCompany::with(['company_description', 'customers', 'country_by_city', 'users', 'factory_info'])
            ->where('id',$profile_id)
            ->first();

        if (!$contact_data) {
            return '<div style="margin:0 auto;width:40%;margin-top:10%;border:1px double rebeccapurple;"><h1 style="text-align:center;color:forestgreen;">Contact information not available!!!</h1><p style="text-align:center;"><a style="text-decoration:none;" href="#" onclick="javascript:window.history.back();">Back</a> | <a style="text-decoration:none;" href="/">Go to home page</a></p></div>';
        }

        $data['product_groups']=BdtdcSupplierProductGroups::where('company_id',$profile_id)->get();
---
update `bdtdc_companies` set `updated_at` = '2020-12-13 05:47:50', `visits` = 1450 where `id` = 851
select * from `bdtdc_companies` where `id` = '851' limit 1
select * from `bdtdc_company_descriptions` where `bdtdc_company_descriptions`.`company_id` in (851)
select * from `users` where `users`.`id` in (931)
select * from `bdtdc_supplier_product_groups` where `company_id` = '851'

    public function render_header_info($id){
        $event_visit =BdtdcCompany::where('id',$id)->first();
---
select * from `bdtdc_companies` where `id` = 'undefined' limit 1