app/Http/Controllers/Front/ServiceChannel/ServiceChannelController.php

select * from `bdtdc_page_content_categories` where `parent_id` = 0
select * from `bdtdc_pages` where `active` = 1 and `prefix` = 'SupplierChannel'
---
    public function bdtdc_faq_supplier(){
        $parent_cat_name = BdtdcPageContentCategory::where('parent_id', 0)->get();
        $link_for_buyers = BdtdcPage::where('active', 1)->where('prefix', 'SupplierChannel')->get();