app/Http/Controllers/MobileView/MobileViewController.php

select * from `bdtdc_page_seo` where `page_id` = 101 limit 1
select * from `bdtdc_category` where `bdtdc_category`.`id` in (364)
select * from `bdtdc_product_to_category` where `category_id` = '364' limit 10 offset 0
select * from `bdtdc_product` where `bdtdc_product`.`id` in (11466, 11467, 11468, 11469, 11470, 11471, 11652, 11661, 11708, 11709)
select count(*) as aggregate from `bdtdc_product_to_category` where `category_id` = '364'
---
    public function sub_category_pro_view($id)
    {
        $header=BdtdcPageSeo::where('page_id',101)->first();
        $data['title']=$header->title;
        $data['keyword']=$header->meta_keyword;
        $data['description']=$header->meta_description;
        $product=BdtdcProductToCategory::with('bdtdcProduct','bdtdcCategory','pro_to_cat_name','cat_pro_price')->where('category_id',$id)->paginate(10);