app/Providers/AppServiceProvider.php

select * from `bdtdc_category` where `bdtdc_category`.`parent_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 202, 203, 205)
select * from `bdtdc_pages` where `active` = 1
select * from `bdtdc_footers` where `parent_id` = 0 limit 5
---
    public function boot()
    {
        //
        Schema::defaultStringLength(191);
        View::composer(array('fontend.layouts.all-category-list','fontend.category.allcategory','fontend.layouts.sidebar-home'),function($view){

            $data['categorys']=BdtdcCategory::with('sub_cat')->where('parent_id','0')->orderBy('sort_order', 'ASC')->where('status',1)->get();
            $view->with($data);
        });

        View::composer(array('fontend.layouts.header-dashboard','fontend.layouts.topbar','fontend.layouts.topbar-home','mobile-view.layout.topbar_m','mobile-view.admin-panel.user-login','fontend.supplier.dashboard','fontend.supplier.product_create','fontend.template.layout_dynamic','fontend.template.templete_layout'),function($view){

            $data['pages']=BdtdcPage::where('active',1)->get();
            $view->with($data);

        });

        View::composer(array('fontend.layouts.footer'),function($view){
            $data['footers']=BdtdcFooterModel::with('sub_pages')->where('parent_id',0)->take(5)->get();

select * from `bdtdc_companies` where `id` = '2168' limit 1
select * from `bdtdc_company_descriptions` where `bdtdc_company_descriptions`.`company_id` in (2168)
select * from `bdtdc_supplier_products` where `supplier_id` = '2168'
select `product_name` from `bdtdc_supplier_main_products` where `supplier_id` = '2168'
select * from `bdtdc_pages` where `prefix` = 'Templete'
select * from `bdtdc_supplier_product_groups` where `company_id` = '2168'
select * from `bdtdc_template_sections` where `bdtdc_template_sections`.`id` in (1, 2, 3, 4)
select * from `bdtdc_template_settings` where `company_id` = '2168'
select * from `bdtdc_pages` where `active` = 1
---
        View::composer(['fontend.template.header_information','fontend.template.templete_layout','fontend.template.product_list','fontend.template.layout_dynamic'],function($view){
            //$profile_id = Route::current()->parameters()['profile_id'];
            $id = Route::current()->parameters()['profile_id'];
            $company = BdtdcCompany::with('company_description')
                ->where('id',$id)
                ->first();

            $products = BdtdcSupplierProduct::with(['products', 'products.product_name'])
                                            ->where('supplier_id',$id)
                                            ->get();

            $main_products = BdtdcSupplierMainProduct::where('supplier_id',$id)->get(['product_name']);
            $nav_menus=BdtdcPage::where('prefix','Templete')->get();

            $product_groups=BdtdcSupplierProductGroups::where('company_id',$id)->get();

            $template_setting_data = BdtdcTemplateSetting::with('template_section')
                                                        ->where('company_id',$id)
                                                        ->get();

            $customer=BdtdcCompany::with('customers','supplier_info','name_string')->where('id',$id)->first();

            $company_no_name = ($customer?($customer->name_string?(trim($customer->name_string->name)!=''?$customer->name_string->name:'not available'):'not available'):'not available');

            $pages=BdtdcPage::where('active',1)->get();