app/Http/Controllers/Front/UserEnd/CategoriesController.php


            $fff=$ff[0];

            $country=BdtdcCountry::where('name',$fff)->first();
---
select * from `bdtdc_country` where `name` = 'assets' limit 1