app/Http/Controllers/StandardUser/UsersController.php

select `id` from `bdtdc_companies` where `user_id` is null limit 1
---
    public function __construct(UserRepositoryInterface $user)
    {

        $ids = (\Sentinel::getUser()) ? \Sentinel::getUser()->id : null;
        $this->company_id = (BdtdcCompany::where('user_id',$ids)) ? BdtdcCompany::where('user_id',$ids)->first(['id']) : null;

select * from `bdtdc_page_seo` where `page_id` = 146 limit 1
---
    public function create(){
        $header=BdtdcPageSeo::where('page_id',146)->first();